For detailed explanation of this examples refer to [pandas.DataFrame.query()](https://sparkbyexamples.com/pandas/pandas.DataFrame.query())

# Pandas.DataFrame.query() by Examples

In [3]:
import pandas as pd
import numpy as np
technologies= {
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas"],
    'Fee' :[22000,25000,23000,24000,26000],
    'Duration':['30days','50days','30days', None,np.nan],
    'Discount':[1000,2300,1000,1200,2500]
          }
df = pd.DataFrame(technologies)
# Query all rows with Courses equals 'Spark'
df2=df.query("Courses == 'Spark'")
df2

  Courses    Fee Duration  Discount
0   Spark  22000   30days      1000

In [5]:
# Query Rows by using Python variable
df=pd.DataFrame(technologies)
value='Spark'
df2=df.query("Courses == @value")
df2

  Courses    Fee Duration  Discount
0   Spark  22000   30days      1000

In [7]:
# Replace current esisting DataFrame
df=pd.DataFrame(technologies)
df2=df.query("Courses == 'Spark'",inplace=True)
df2

In [8]:
# not equals condition
df=pd.DataFrame(technologies)
df2=df.query("Courses != 'Spark'")
df2

   Courses    Fee Duration  Discount
1  PySpark  25000   50days      2300
2   Hadoop  23000   30days      1000
3   Python  24000     None      1200
4   Pandas  26000      NaN      2500

In [9]:
# Query Rows by list of values
df=pd.DataFrame(technologies)
df2=df.query("Courses in ('Spark','PySpark')")
df2

   Courses    Fee Duration  Discount
0    Spark  22000   30days      1000
1  PySpark  25000   50days      2300

In [10]:
# Query Rows by list of values
values=['Spark','PySpark']
df2=df.query("Courses in @values")
df2

   Courses    Fee Duration  Discount
0    Spark  22000   30days      1000
1  PySpark  25000   50days      2300

In [11]:
# Query Rows not in list of values
values=['Spark','PySpark']
df2=df.query("Courses not in @values")
df2

  Courses    Fee Duration  Discount
2  Hadoop  23000   30days      1000
3  Python  24000     None      1200
4  Pandas  26000      NaN      2500

In [22]:
# By using lambda function
df2=df.apply(lambda row: row[df['Courses'].isin(['Spark','PySpark'])])
df2

   Courses    Fee Duration  Discount
0    Spark  22000   30days      1000
1  PySpark  25000   50days      2300

In [24]:
# Other examples you can try to query rows
df2=df[df["Courses"] == 'Spark'] 
df2

  Courses    Fee Duration  Discount
0   Spark  22000   30days      1000

In [25]:
df2=df.loc[df['Courses'] == value]
df2

  Courses    Fee Duration  Discount
0   Spark  22000   30days      1000

In [27]:
df2=df.loc[(df['Discount'] >= 1000) & (df['Discount'] <= 2000)]
df2

  Courses    Fee Duration  Discount
0   Spark  22000   30days      1000
2  Hadoop  23000   30days      1000
3  Python  24000     None      1200

In [28]:
df2=df.loc[(df['Discount'] >= 1200) & (df['Fee'] >= 23000 )]
df2

   Courses    Fee Duration  Discount
1  PySpark  25000   50days      2300
3   Python  24000     None      1200
4   Pandas  26000      NaN      2500